app/views/authors/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---
            <div class="field data-turbolinks="false"">
              <%= form.collection_select :category_id, Category.all, :id, :name, {prompt: "Choose a category" }, input_html: { class: "dropdown-toggle" } %>