app/views/layouts/_navbar.html.erb

        <li class="list-group-item">
          <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"